Revit 2023 API
MassZone.ConditionType Property
 The gbXMLConditionType of the MassZone.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2012
Syntax
C#
public gbXMLConditionType ConditionType { get; set; }
Visual Basic
Public Property ConditionType As gbXMLConditionType
	Get
	Set
Visual C++
public:
property gbXMLConditionType ConditionType {
	gbXMLConditionType get ();
	void set (gbXMLConditionType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The condition type does not fall within an appropriate range.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace